app/views/partials/_parent_dashboard.html.erb

      <tr>
        <td><%= link_to child.get_user.first.username, child.get_user %></td>
---
SELECT "users".* FROM "users"