app/controllers/accounts_controller.rb

SELECT "accounts".* FROM "accounts"
SELECT "users".* FROM "users"
---
  def index
    @accounts = Account.all
    #need to add the childrens accounts to this list
    @parent_accounts = Account.all.select{|a| a.user_id == current_user.id}

UPDATE "accounts" SET "interest_rate" = ?, "updated_at" = ? WHERE "accounts"."id" = ?  [["interest_rate", 10.0], ["updated_at", "2019-06-06 13:48:56.382170"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @account.update(account_params)