app/controllers/camps_controller.rb

SELECT  "camps".* FROM "camps" WHERE "camps"."id" = ? LIMIT ?
---
    def set_camp
      @camp = Camp.find(params[:id])