app/controllers/goals_controller.rb

  def index
    @goals = Goal.all
---
SELECT "goals".* FROM "goals"