app/controllers/home_controller.rb

SELECT "curriculums".* FROM "curriculums"
SELECT "instructors".* FROM "instructors"
SELECT "students".* FROM "students"
SELECT "locations".* FROM "locations"
---
  def dashboard


    #all for admin
    @num_camps = Camp.all.to_a.count
    @num_currs = Curriculum.all.to_a.count
    @num_instructors = Instructor.all.to_a.count
    @num_students = Student.all.to_a.count
    @num_locations = Location.all.to_a.count
    @num_families = Family.all.to_a.count
    @camps_without_instructors = Camp.all.active.chronological.select{|c| c.instructors.count == 0}
    @camps_without_instructors_count = Camp.all.active.chronological.select{|c| c.instructors.count == 0}.count
    @top_3_students = Student.all.ranking.limit(3)