app/controllers/transactions_controller.rb

  def create
    @transaction = Transaction.new(transaction_params)

    respond_to do |format|
      if @transaction.save
---
INSERT INTO "transactions" ("amount", "description", "to_account", "from_account", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)