app/models/user.rb

INSERT INTO "accounts" ("user_id", "name", "interest_rate", "balance", "account_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create_accounts
        Account.create(user: self, name: "Default Checking Account", interest_rate: 0, balance: 0, account_type: "checking")
        Account.create(user: self, name: "Default Savings Account", interest_rate: 5, balance: 0, account_type: "savings")